# Задача_1 вывод имени 
puts 'Введите ваше: '
name = gets 
puts ('Привет,' + name)

# Задача 2 'Введите год рождения и вывести количество лет'
puts 'Введите год рождения: '
year = gets
puts 'Ваш возраст: ' + (2021 - yaer.to_i).to_s

# Задача 3 'Задать сторону квадрата и вывести периметр квадрата'
puts 'Задайте длину стороны квадрата: '
side = gets
puts (side.to_i * 4)

# Задача 4 'Площадь окружности'
puts 'Введите радиус окружности: '
radius = gets
puts 'Площадь круга: ' + (3.14 *(radius.to.i ** 2)).to_s

# Задача 5 'Посчитать время потраченную на дистанцию'
puts "Введите дистанцию"
dis = gets.to_f
puts "Введите время"



